import 'package:azkar_app/models/zikr_model.dart';

List<Zikr> getOtherAzkar() {
  return [
    Zikr(
      id: 'o1',
      text: 'الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة.',
      count: 1,
    ),
    Zikr(
      id: 'o2',
      text: 'اللهم لك الحمد أنت كسوتنيه، أسألك من خيره.',
      count: 1,
    ),
    Zikr(
      id: 'o3',
      text: 'لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم\n'
          'اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت\n'
          'لا إله إلا أنت سبحانك إني كنت من الظالمين\n'
          'الله الله رب لا أشرك به شيئا',
      count: 1,
    ),
    Zikr(
      id: 'o4',
      text: 'اللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماض في حكمك ، عدل في قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي.\n'
          'اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال.',
      count: 1,
    ),
    Zikr(
      id: 'o5',
      text: 'اللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك.',
      count: 1,
    ),
    Zikr(
      id: 'o6',
      text: 'اللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به.',
      count: 1,
    ),
    Zikr(
      id: 'o7',
      text: 'سبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته.',
      count: 1,
    ),
    Zikr(
      id: 'o8',
      text: 'السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية.',
      count: 1,
    ),
    Zikr(
      id: 'o9',
      text: 'اللهم صيباَ نافعاَ.',
      count: 1,
    ),
    Zikr(
      id: 'o10',
      text: 'بسم الله ، الحمد لله ، سبحان الذي سخر لنا هذا وماكنا له مقرنين وإنا إلى ربنا لمنقلبون، الحمد لله ، الحمد لله ، الحمد لله ، الله اكبر ، الله أكبر ، الله أكبر ، سبحانك اللهم إني ظلمت نفسي فاغفر لي ، فإنه لايغفر الذنوب إلا أنت.',
      count: 1,
    ),
    Zikr(
      id: 'o11',
      text: 'اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل.\n'
          'وإذا رجع قالهن وزاد فيهن ـ" آيبون ،تآئبون، عابدون ، لربنا حامدون.',
      count: 1,
    ),
    Zikr(
      id: 'o12',
      text: 'استودعكم الله الذي لا تضيع ودائعه.',
      count: 1,
    ),
    Zikr(
      id: 'o13',
      text: 'أستودع ُ الله دينك وأمانتك ، وخواتيم عملك زودك الله التقوى، وغفر ذنبك، ويسر لك الخير حيث ما كنت.',
      count: 1,
    ),
    Zikr(
      id: 'o14',
      text: 'أعوذ بكلمات الله التامات من شر ما خلق.',
      count: 1,
    ),
    Zikr(
      id: 'o15',
      text: 'رب اغفر لي رب اغفر لي اللهم اغفر لي ، وارحمني واهدني واجبرني وعافني وارزقني وارفعني.',
      count: 1,
    ),
    Zikr(
      id: 'o16',
      text: 'اللهم لاسهل إلا ماجعلته سهلا وأنت تجعل الحزن إذا شئت سهلا.',
      count: 1,
    ),
    Zikr(
      id: 'o17',
      text: 'اللهم إني أ عوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم.',
      count: 1,
    ),
    Zikr(
      id: 'o18',
      text: 'رب اغفر لي وتب عليّ إنك أنت التواب الغفور.',
      count: 100,
    ),
    Zikr(
      id: 'o19',
      text: 'سبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك.',
      count: 1,
    ),
    Zikr(
      id: 'o20',
      text: 'الحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلاً.',
      count: 1,
    ),
    Zikr(
      id: 'o21',
      text: 'أعوذ بالله من الشيطان الرجيـم.',
      count: 1,
    ),
    Zikr(
      id: 'o22',
      text: 'بارك الله لك ، وبارك عليك ، وجمع بينكما في خير.',
      count: 1,
    ),
    Zikr(
      id: 'o23',
      text: 'اللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك.',
      count: 1,
    ),
    Zikr(
      id: 'o24',
      text: 'بسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا.',
      count: 1,
    ),
    Zikr(
      id: 'o25',
      text: 'إذا عطـس أحـدكم فليقل : الحمـد لله ، وليقل له أخـوه ، أو صاحبه : يرحمـك الله فـإذا قال له : يرحمك الله ، فليقل : يهديكم الله ويصلح بالكم.',
      count: 1,
    ),
    Zikr(
      id: 'o26',
      text: 'ذهب الضمـأ ، وأبتلت العروق ، وثبت الأجر إن شاء الله.',
      count: 1,
    ),
    Zikr(
      id: 'o27',
      text: 'أفطر عندكم الصائمون ، وأكل طعامكم الأبرار ، وصلت عليكم الملائكة.',
      count: 1,
    ),
    Zikr(
      id: 'o28',
      text: 'الله أكبر ، اللهم أهله علينا بالأمن ، والإيمان والسلامة ، والإسلام ، والتوفيق لما تحب وترضى ربنا وربك الله.',
      count: 1,
    ),
    Zikr(
      id: 'o29',
      text: 'إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها.',
      count: 1,
    ),
    Zikr(
      id: 'o30',
      text: 'لابأس طهور إن شاء الله مامن عبد مسلم يعود مريضاً لم يحضر أجله فيقول سبع مرات : أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي.',
      count: 1,
    ),
    Zikr(
      id: 'o31',
      text: 'اللهم اغفر لي وارحمني والحقني بالرفيق الأعلى.',
      count: 1,
    ),
    Zikr(
      id: 'o32',
      text: 'أعيذكما بكلمات الله التامة من كل شيطان وهامة ، ومن كل عين لامة.',
      count: 1,
    ),
    Zikr(
      id: 'o33',
      text: 'حسـبنا الله ونعـم الـوكـيل\n'
          'اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم\n'
          'اللهم أنت عضدي ، وأنت نصيري ، بك أجول وبك أصول وبك أقاتل',
      count: 1,
    ),
    Zikr(
      id: 'o34',
      text: 'اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولاأعلم وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر ـ ويسمي حاجته ـ خيرا لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فأقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم ارضني به.',
      count: 1,
    ),
    Zikr(
      id: 'o35',
      text: 'سجد وجهي للذي خلقه ،وشق سمعه وبصره بحوله وقوته ( فتبارك الله احسن الخالقين).',
      count: 1,
    ),
    Zikr(
      id: 'o36',
      text: 'اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد.\n'
          'سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدُّك ولاإله غيرك.\n'
          'الله اكبر كبيرا ، الله اكبر كبيرا ، الله اكبر كبيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، وسبحان الله بكرة وأصيلا(ثلاثـــا) ـ "اعوذ بالله من الشيطان من نفحه ونفثه وهمزه ".',
      count: 1,
    ),
    Zikr(
      id: 'o37',
      text: 'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير (كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة ورفع له ألف الف درجة وفي رواية: وبنى له بيتا في الجنة).\n'
          'بسم الله، اللهم إني أسألك خير هذه السوق، وخير ما فيها، وأعوذ بك من شرها وشر ما فيها، اللهم إني أعوذ بك أن أصيب بها يميناً فاجرةً، أو صفقة خاسرة.',
      count: 1,
    ),
    Zikr(
      id: 'o38',
      text: 'ما من عبد يذنب ذنباً فيتوضأ فيحسن الطهور،ثم يقوم فيصلي ركعتين ، ثم يستغفر الله لذلك الذنب إلاَّ غُفر له.',
      count: 1,
    ),
    Zikr(
      id: 'o39',
      text: 'الدعاء عند صياح الديك : اللهم إني أسألك من فضلـــك.\n'
          'الدعاء عند صياح الديك و نهيق الحمار و نباح الكلاب: أعوذ بالله من الشيطان الرجيم.',
      count: 1,
    ),
    Zikr(
      id: 'o40',
      text: 'اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت.',
      count: 1,
    ),
    Zikr(
      id: 'o41',
      text: 'ضع يدك على الذي تألَّم من جسدك وقل: بسم الله ،ثلاثاً ،وقل سبع مرات: أعوذُ بالله وقُدْرَتِهِ من شَرِّ مَا أَجِدُ واُحَاذِرُ.',
      count: 1,
    ),
    Zikr(
      id: 'o42',
      text: 'مامن عبد يذنب ذنباً فيحسـن الطهور ثم يقوم فيصلي ركعتين ، ثم يستغــفــر الله إلا غفر له.',
      count: 1,
    ),
  ];
}